<!DOCTYPE html>
<html>
	<title>&#20013;&#25991;&#20998;&#35789;&#25216;&#26415;&#31616;&#20171;</title>
	<meta charset="UTF-8">

	<xmp theme="united" style="display:none;">
#### &#32972;&#26223;
* &#33521;&#25991;&#20197;&#31354;&#26684;&#20316;&#20026;&#20998;&#38548;&#31526;&#65292;&#32780;&#20013;&#25991;&#35789;&#35821;&#20043;&#38388;&#27809;&#26377;&#20998;&#38548;&#65307;
* &#22312;&#20013;&#25991;&#37324;&#65292;&#35789;&#21644;&#35789;&#32452;&#36793;&#30028;&#27169;&#31946;&#29616;&#20195;&#27721;&#35821;&#30340;&#22522;&#26412;&#34920;&#36798;&#21333;&#20803;&#34429;&#28982;&#20026;&#35789;&#65292;&#19988;&#20197;&#21452;&#23383;&#25110;&#32773;&#22810;&#23383;&#35789;&#23621;&#22810;&#65292;&#20294;&#30001;&#20110;&#20154;&#20204;&#35748;&#35782;&#27700;&#24179;&#30340;&#19981;&#21516;&#65292;&#23545;&#35789;&#21644;&#30701;&#35821;&#30340;&#36793;&#30028;&#24456;&#38590;&#21435;&#21306;&#20998;&#65307;

&#20013;&#25991;&#20998;&#35789;&#30340;&#26041;&#27861;&#20854;&#23454;&#19981;&#23616;&#38480;&#20110;&#20013;&#25991;&#24212;&#29992;&#65292;&#20063;&#34987;&#24212;&#29992;&#21040;&#33521;&#25991;&#22788;&#29702;&#65292;&#22914;&#25163;&#20889;&#35782;&#21035;&#65292;&#21333;&#35789;&#20043;&#38388;&#30340;&#31354;&#26684;&#23601;&#19981;&#24456;&#28165;&#26970;&#65292;&#20013;&#25991;&#20998;&#35789;&#26041;&#27861;&#21487;&#20197;&#24110;&#21161;&#21028;&#21035;&#33521;&#25991;&#21333;&#35789;&#30340;&#36793;&#30028;&#12290;

#### &#20998;&#35789;&#31639;&#27861;
&#29616;&#26377;&#30340;&#20998;&#35789;&#31639;&#27861;&#21487;&#20197;&#20998;&#20026;&#19977;&#22823;&#31867;&#65306;*&#22522;&#20110;&#23383;&#31526;&#20018;&#21305;&#37197;&#30340;&#20998;&#35789;&#26041;&#27861;&#65292;&#22522;&#20110;&#29702;&#35299;&#30340;&#20998;&#35789;&#26041;&#27861;&#65292;&#22522;&#20110;&#32479;&#35745;&#20197;&#21450;&#26426;&#22120;&#23398;&#20064;&#30340;&#20998;&#35789;&#26041;&#27861;*&#12290;

###### &#22522;&#20110;&#23383;&#31526;&#20018;&#21305;&#37197;&#30340;&#20998;&#35789;&#26041;&#27861;
&#36825;&#31181;&#26041;&#27861;&#21448;&#21483;&#20570;&#26426;&#26800;&#20998;&#35789;&#26041;&#27861;&#65292;&#23427;&#26159;&#25353;&#29031;&#19968;&#23450;&#30340;&#31574;&#30053;&#23558;&#24453;&#20998;&#26512;&#30340;&#27721;&#23383;&#20018;&#19982;&#19968;&#20010;&#20805;&#20998;&#22823;&#30340;&#26426;&#22120;&#35789;&#20856;&#20013;&#30340;&#35789;&#26465;&#36827;&#34892;&#37197;&#65292;&#33509;&#22312;&#35789;&#20856;&#20013;&#25214;&#21040;&#26576;&#20010;&#23383;&#31526;&#20018;&#65292;&#21017;&#21305;&#37197;&#25104;&#21151;&#65288;&#35782;&#21035;&#20986;&#19968;&#20010;&#35789;&#65289;&#12290;&#25353;&#29031;&#25195;&#25551;&#26041;&#21521;&#30340;&#19981;&#21516;&#65292;&#20018;&#21305;&#37197;&#20998;&#35789;&#26041;&#27861;&#21487;&#20197;&#20998;&#20026;&#27491;&#21521;&#21305;&#37197;&#21644;&#36870;&#21521;&#21305;&#37197;&#65307;&#25353;&#29031;&#19981;&#21516;&#38271;&#24230;&#20248;&#20808;&#21305;&#37197;&#30340;&#24773;&#20917;&#65292;&#21487;&#20197;&#20998;&#20026;&#26368;&#22823;&#65288;&#26368;&#38271;&#65289;&#21305;&#37197;&#21644;&#26368;&#23567;&#65288;&#26368;&#30701;&#65289;&#21305;&#37197;&#65307;&#24120;&#29992;&#30340;&#20960;&#31181;&#26426;&#26800;&#20998;&#35789;&#26041;&#27861;&#22914;&#19979;&#65306;
* &#27491;&#21521;&#26368;&#22823;&#21305;&#37197;&#27861;&#65288;&#30001;&#24038;&#21040;&#21491;&#30340;&#26041;&#21521;&#65289;&#65307;
* &#36870;&#21521;&#26368;&#22823;&#21305;&#37197;&#27861;&#65288;&#30001;&#21491;&#21040;&#24038;&#30340;&#26041;&#21521;&#65289;&#65307;
* &#26368;&#23569;&#20999;&#20998;&#65288;&#20351;&#27599;&#19968;&#21477;&#20013;&#20999;&#20986;&#30340;&#35789;&#25968;&#26368;&#23567;&#65289;&#65307;
* &#21452;&#21521;&#26368;&#22823;&#21305;&#37197;&#27861;&#65288;&#36827;&#34892;&#30001;&#24038;&#21040;&#21491;&#12289;&#30001;&#21491;&#21040;&#24038;&#20004;&#27425;&#25195;&#25551;&#65289;

&#36824;&#21487;&#20197;&#23558;&#19978;&#36848;&#21508;&#31181;&#26041;&#27861;&#30456;&#20114;&#32452;&#21512;&#12290;&#20363;&#22914;&#65292;&#21487;&#20197;&#23558;&#27491;&#21521;&#26368;&#22823;&#21305;&#37197;&#26041;&#27861;&#21644;&#36870;&#21521;&#26368;&#22823;&#21305;&#37197;&#26041;&#27861;&#32467;&#21512;&#36215;&#26469;&#26500;&#25104;&#21452;&#21521;&#21305;&#37197;&#27861;&#12290;&#30001;&#20110;&#27721;&#35821;&#21333;&#23383;&#25104;&#35789;&#30340;&#29305;&#28857;&#65292;&#27491;&#21521;&#26368;&#23567;&#21305;&#37197;&#21644;&#36870;&#21521;&#26368;&#23567;&#21305;&#37197;&#19968;&#33324;&#24456;&#23569;&#20351;&#29992;&#12290;&#19968;&#33324;&#35828;&#26469;&#65292;&#36870;&#21521;&#21305;&#37197;&#30340;&#20999;&#20998;&#31934;&#24230;&#30053;&#39640;&#20110;&#27491;&#21521;&#21305;&#37197;&#65292;&#36935;&#21040;&#30340;&#27495;&#20041;&#29616;&#35937;&#20063;&#36739;&#23569;&#12290;

&#32479;&#35745;&#32467;&#26524;&#34920;&#26126;&#65292;&#21333;&#32431;&#20351;&#29992;&#27491;&#21521;&#26368;&#22823;&#21305;&#37197;&#30340;&#38169;&#35823;&#29575;&#20026;1/169&#65292;&#21333;&#32431;&#20351;&#29992;&#36870;&#21521;&#26368;&#22823;&#21305;&#37197;&#30340;&#38169;&#35823;&#29575;&#20026;1/245&#12290;&#20294;&#36825;&#31181;&#31934;&#24230;&#36824;&#36828;&#36828;&#19981;&#33021;&#28385;&#36275;&#23454;&#38469;&#30340;&#38656;&#35201;&#12290;&#23454;&#38469;&#20351;&#29992;&#30340;&#20998;&#35789;&#31995;&#32479;&#65292;&#37117;&#26159;&#25226;&#26426;&#26800;&#20998;&#35789;&#20316;&#20026;&#19968;&#31181;&#21021;&#20998;&#25163;&#27573;&#65292;&#36824;&#38656;&#36890;&#36807;&#21033;&#29992;&#21508;&#31181;&#20854;&#23427;&#30340;&#35821;&#35328;&#20449;&#24687;&#26469;&#36827;&#19968;&#27493;&#25552;&#39640;&#20999;&#20998;&#30340;&#20934;&#30830;&#29575;&#12290;

###### &#22522;&#20110;&#29702;&#35299;&#30340;&#20998;&#35789;&#26041;&#27861;
&#36825;&#31181;&#20998;&#35789;&#26041;&#27861;&#26159;&#36890;&#36807;&#35753;&#35745;&#31639;&#26426;&#27169;&#25311;&#20154;&#23545;&#21477;&#23376;&#30340;&#29702;&#35299;&#65292;&#36798;&#21040;&#35782;&#21035;&#35789;&#30340;&#25928;&#26524;&#12290;&#20854;&#22522;&#26412;&#24605;&#24819;&#23601;&#26159;&#22312;&#20998;&#35789;&#30340;&#21516;&#26102;&#36827;&#34892;&#21477;&#27861;&#12289;&#35821;&#20041;&#20998;&#26512;&#65292;&#21033;&#29992;&#21477;&#27861;&#20449;&#24687;&#21644;&#35821;&#20041;&#20449;&#24687;&#26469;&#22788;&#29702;&#27495;&#20041;&#29616;&#35937;&#12290;&#23427;&#36890;&#24120;&#21253;&#25324;&#19977;&#20010;&#37096;&#20998;&#65306;&#20998;&#35789;&#23376;&#31995;&#32479;&#12289;&#21477;&#27861;&#35821;&#20041;&#23376;&#31995;&#32479;&#12289;&#24635;&#25511;&#37096;&#20998;&#12290;&#22312;&#24635;&#25511;&#37096;&#20998;&#30340;&#21327;&#35843;&#19979;&#65292;&#20998;&#35789;&#23376;&#31995;&#32479;&#21487;&#20197;&#33719;&#24471;&#26377;&#20851;&#35789;&#12289;&#21477;&#23376;&#31561;&#30340;&#21477;&#27861;&#21644;&#35821;&#20041;&#20449;&#24687;&#26469;&#23545;&#20998;&#35789;&#27495;&#20041;&#36827;&#34892;&#21028;&#26029;&#65292;&#21363;&#23427;&#27169;&#25311;&#20102;&#20154;&#23545;&#21477;&#23376;&#30340;&#29702;&#35299;&#36807;&#31243;&#12290;&#36825;&#31181;&#20998;&#35789;&#26041;&#27861;&#38656;&#35201;&#20351;&#29992;&#22823;&#37327;&#30340;&#35821;&#35328;&#30693;&#35782;&#21644;&#20449;&#24687;&#12290;&#30001;&#20110;&#27721;&#35821;&#35821;&#35328;&#30693;&#35782;&#30340;&#31548;&#32479;&#12289;&#22797;&#26434;&#24615;&#65292;&#38590;&#20197;&#23558;&#21508;&#31181;&#35821;&#35328;&#20449;&#24687;&#32452;&#32455;&#25104;&#26426;&#22120;&#21487;&#30452;&#25509;&#35835;&#21462;&#30340;&#24418;&#24335;&#65292;&#22240;&#27492;&#30446;&#21069;&#22522;&#20110;&#29702;&#35299;&#30340;&#20998;&#35789;&#31995;&#32479;&#36824;&#22788;&#22312;&#35797;&#39564;&#38454;&#27573;&#12290;

###### &#22522;&#20110;&#32479;&#35745;&#20197;&#21450;&#26426;&#22120;&#23398;&#20064;&#30340;&#20998;&#35789;&#26041;&#27861;
&#36825;&#31867;&#20998;&#35789;&#22522;&#20110;&#20154;&#24037;&#26631;&#27880;&#30340;&#35789;&#24615;&#21644;&#32479;&#35745;&#29305;&#24449;&#65292;&#23545;&#20013;&#25991;&#36827;&#34892;&#24314;&#27169;&#65292;&#21363;&#26681;&#25454;&#35266;&#27979;&#21040;&#30340;&#25968;&#25454;&#65288;&#26631;&#27880;&#22909;&#30340;&#35821;&#26009;&#65289;&#23545;&#27169;&#22411;&#21442;&#25968;&#36827;&#34892;&#20272;&#35745;&#65292;&#21363;&#35757;&#32451;&#12290; &#22312;&#20998;&#35789;&#38454;&#27573;&#20877;&#36890;&#36807;&#27169;&#22411;&#35745;&#31639;&#21508;&#31181;&#20998;&#35789;&#20986;&#29616;&#30340;&#27010;&#29575;&#65292;&#23558;&#27010;&#29575;&#26368;&#22823;&#30340;&#20998;&#35789;&#32467;&#26524;&#20316;&#20026;&#26368;&#32456;&#32467;&#26524;&#12290;&#24120;&#35265;&#30340;&#24207;&#21015;&#26631;&#27880;&#27169;&#22411;&#26377;HMM&#21644;CRF&#12290;

&#20174;&#24418;&#24335;&#19978;&#30475;&#65292;&#35789;&#26159;&#31283;&#23450;&#30340;&#23383;&#30340;&#32452;&#21512;&#65292;&#22240;&#27492;&#22312;&#19978;&#19979;&#25991;&#20013;&#65292;&#30456;&#37051;&#30340;&#23383;&#21516;&#26102;&#20986;&#29616;&#30340;&#27425;&#25968;&#36234;&#22810;&#65292;&#23601;&#36234;&#26377;&#21487;&#33021;&#26500;&#25104;&#19968;&#20010;&#35789;&#12290;&#22240;&#27492;&#23383;&#19982;&#23383;&#30456;&#37051;&#20849;&#29616;&#30340;&#39057;&#29575;&#25110;&#27010;&#29575;&#33021;&#22815;&#36739;&#22909;&#30340;&#21453;&#26144;&#25104;&#35789;&#30340;&#21487;&#20449;&#24230;&#12290;&#21487;&#20197;&#23545;&#35821;&#26009;&#20013;&#30456;&#37051;&#20849;&#29616;&#30340;&#21508;&#20010;&#23383;&#30340;&#32452;&#21512;&#30340;&#39057;&#24230;&#36827;&#34892;&#32479;&#35745;&#65292;&#35745;&#31639;&#23427;&#20204;&#30340;&#20114;&#29616;&#20449;&#24687;&#12290;&#23450;&#20041;&#20004;&#20010;&#23383;&#30340;&#20114;&#29616;&#20449;&#24687;&#65292;&#35745;&#31639;&#20004;&#20010;&#27721;&#23383;X&#12289;Y&#30340;&#30456;&#37051;&#20849;&#29616;&#27010;&#29575;&#12290;&#20114;&#29616;&#20449;&#24687;&#20307;&#29616;&#20102;&#27721;&#23383;&#20043;&#38388;&#32467;&#21512;&#20851;&#31995;&#30340;&#32039;&#23494;&#31243;&#24230;&#12290;&#24403;&#32039;&#23494;&#31243;&#24230;&#39640;&#20110;&#26576;&#19968;&#20010;&#38408;&#20540;&#26102;&#65292;&#20415;&#21487;&#35748;&#20026;&#27492;&#23383;&#32452;&#21487;&#33021;&#26500;&#25104;&#20102;&#19968;&#20010;&#35789;&#12290;&#36825;&#31181;&#26041;&#27861;&#21482;&#38656;&#23545;&#35821;&#26009;&#20013;&#30340;&#23383;&#32452;&#39057;&#24230;&#36827;&#34892;&#32479;&#35745;&#65292;&#19981;&#38656;&#35201;&#20999;&#20998;&#35789;&#20856;&#65292;&#22240;&#32780;&#21448;&#21483;&#20570;&#26080;&#35789;&#20856;&#20998;&#35789;&#27861;&#25110;&#32479;&#35745;&#21462;&#35789;&#26041;&#27861;&#12290;

&#20294;&#36825;&#31181;&#26041;&#27861;&#20063;&#26377;&#19968;&#23450;&#30340;&#23616;&#38480;&#24615;&#65292;&#20250;&#32463;&#24120;&#25277;&#20986;&#19968;&#20123;&#20849;&#29616;&#39057;&#24230;&#39640;&#12289;&#20294;&#24182;&#19981;&#26159;&#35789;&#30340;&#24120;&#29992;&#23383;&#32452;&#65292;&#20363;&#22914;&#36825;&#19968;&#12289;&#20043;&#19968;&#12289;&#26377;&#30340;&#12289;&#25105;&#30340;&#12289;&#35768;&#22810;&#30340;&#31561;&#65292;&#24182;&#19988;&#23545;&#24120;&#29992;&#35789;&#30340;&#35782;&#21035;&#31934;&#24230;&#24046;&#65292;&#26102;&#31354;&#24320;&#38144;&#22823;&#12290;&#23454;&#38469;&#24212;&#29992;&#30340;&#32479;&#35745;&#20998;&#35789;&#31995;&#32479;&#37117;&#35201;&#20351;&#29992;&#19968;&#37096;&#22522;&#26412;&#30340;&#20998;&#35789;&#35789;&#20856;&#65288;&#24120;&#29992;&#35789;&#35789;&#20856;&#65289;&#36827;&#34892;&#20018;&#21305;&#37197;&#20998;&#35789;&#65292;&#21516;&#26102;&#20351;&#29992;&#32479;&#35745;&#26041;&#27861;&#35782;&#21035;&#19968;&#20123;&#26032;&#30340;&#35789;&#65292;&#21363;&#23558;&#20018;&#39057;&#32479;&#35745;&#21644;&#20018;&#21305;&#37197;&#32467;&#21512;&#36215;&#26469;&#65292;&#26082;&#21457;&#25381;&#21305;&#37197;&#20998;&#35789;&#20999;&#20998;&#36895;&#24230;&#24555;&#12289;&#25928;&#29575;&#39640;&#30340;&#29305;&#28857;&#65292;&#21448;&#21033;&#29992;&#20102;&#26080;&#35789;&#20856;&#20998;&#35789;&#32467;&#21512;&#19978;&#19979;&#25991;&#35782;&#21035;&#29983;&#35789;&#12289;&#33258;&#21160;&#28040;&#38500;&#27495;&#20041;&#30340;&#20248;&#28857;&#12290;

&#21478;&#22806;&#19968;&#31867;&#26159;&#22522;&#20110;&#32479;&#35745;&#26426;&#22120;&#23398;&#20064;&#30340;&#26041;&#27861;&#12290;&#39318;&#20808;&#32473;&#20986;&#22823;&#37327;&#24050;&#32463;&#20998;&#35789;&#30340;&#25991;&#26412;&#65292;&#21033;&#29992;&#32479;&#35745;&#26426;&#22120;&#23398;&#20064;&#27169;&#22411;&#23398;&#20064;&#35789;&#35821;&#20999;&#20998;&#30340;&#35268;&#24459;&#65288;&#31216;&#20026;&#35757;&#32451;&#65289;&#65292;&#20174;&#32780;&#23454;&#29616;&#23545;&#26410;&#30693;&#25991;&#26412;&#30340;&#20999;&#20998;&#12290;&#25105;&#20204;&#30693;&#36947;&#65292;&#27721;&#35821;&#20013;&#21508;&#20010;&#23383;&#21333;&#29420;&#20316;&#35789;&#35821;&#30340;&#33021;&#21147;&#26159;&#19981;&#21516;&#30340;&#65292;&#27492;&#22806;&#26377;&#30340;&#23383;&#24120;&#24120;&#20316;&#20026;&#21069;&#32512;&#20986;&#29616;&#65292;&#26377;&#30340;&#23383;&#21364;&#24120;&#24120;&#20316;&#20026;&#21518;&#32512;&#65288;&#32773;&#24615;&#65289;&#65292;&#32467;&#21512;&#20004;&#20010;&#23383;&#30456;&#20020;&#26102;&#26159;&#21542;&#25104;&#35789;&#30340;&#20449;&#24687;&#65292;&#36825;&#26679;&#23601;&#24471;&#21040;&#20102;&#35768;&#22810;&#19982;&#20998;&#35789;&#26377;&#20851;&#30340;&#30693;&#35782;&#12290;&#36825;&#31181;&#26041;&#27861;&#23601;&#26159;&#20805;&#20998;&#21033;&#29992;&#27721;&#35821;&#32452;&#35789;&#30340;&#35268;&#24459;&#26469;&#20998;&#35789;&#12290;

&#20248;&#28857;&#65306;
* &#36825;&#31867;&#20998;&#35789;&#31639;&#27861;&#33021;&#24456;&#22909;&#22788;&#29702;&#27495;&#20041;&#21644;&#26410;&#30331;&#24405;&#35789;&#38382;&#39064;&#65292;&#25928;&#26524;&#27604;&#21069;&#19968;&#31867;&#25928;&#26524;&#22909;&#65307;

&#32570;&#28857;&#65306;
* &#38656;&#35201;&#39044;&#20808;&#26377;&#22823;&#37327;&#20154;&#24037;&#26631;&#27880;&#25968;&#25454;&#20998;&#22909;&#35789;&#30340;&#35821;&#26009;&#20316;&#25903;&#25745;&#65307;
* &#36739;&#24930;&#30340;&#20998;&#35789;&#36895;&#24230;&#65307;
* &#35757;&#32451;&#36807;&#31243;&#20013;&#26102;&#31354;&#24320;&#38144;&#26497;&#22823;&#12290;

###### &#20998;&#35789;&#26041;&#27861;&#24635;&#32467;
&#21040;&#24213;&#21738;&#31181;&#20998;&#35789;&#31639;&#27861;&#30340;&#20934;&#30830;&#24230;&#26356;&#39640;&#65292;&#30446;&#21069;&#24182;&#26080;&#23450;&#35770;&#12290;&#23545;&#20110;&#20219;&#20309;&#19968;&#20010;&#25104;&#29087;&#30340;&#20998;&#35789;&#31995;&#32479;&#26469;&#35828;&#65292;&#19981;&#21487;&#33021;&#21333;&#29420;&#20381;&#38752;&#26576;&#19968;&#31181;&#31639;&#27861;&#26469;&#23454;&#29616;&#65292;&#37117;&#38656;&#35201;&#32508;&#21512;&#19981;&#21516;&#30340;&#31639;&#27861;&#12290;&#20363;&#22914;&#65292;&#28023;&#37327;&#31185;&#25216;&#30340;&#20998;&#35789;&#31639;&#27861;&#23601;&#37319;&#29992;&#22797;&#26041;&#20998;&#35789;&#27861;&#65292;&#25152;&#35859;&#22797;&#26041;&#65292;&#23601;&#26159;&#20687;&#20013;&#35199;&#21307;&#32467;&#21512;&#33324;&#32508;&#21512;&#36816;&#29992;&#26426;&#26800;&#26041;&#27861;&#21644;&#30693;&#35782;&#26041;&#27861;&#12290;&#23545;&#20110;&#25104;&#29087;&#30340;&#20013;&#25991;&#20998;&#35789;&#31995;&#32479;&#65292;&#38656;&#35201;&#22810;&#31181;&#31639;&#27861;&#32508;&#21512;&#22788;&#29702;&#38382;&#39064;&#12290;

#### &#24120;&#29992;&#30340;&#20998;&#35789;&#24037;&#20855;
###### &#22522;&#20110;&#23383;&#31526;&#20018;&#21305;&#37197;&#30340;&#20998;&#35789;&#24037;&#20855;
* &#22312;github&#24320;&#28304;&#30340; [ik-analyzer](https://code.google.com/archive/p/ik-analyzer/)&#65292;&#39033;&#30446;&#28304;&#30721;&#65306;https://github.com/wks/ik-analyzer
* &#29992;Java&#24320;&#21457;&#30340; [Paoding &#20998;&#35789;&#22120;](https://code.google.com/archive/p/paoding/) &#65292;[&#22522;&#20110;Lucene4.x&#30340;paoding&#20998;&#35789;&#22120;](http://git.oschina.net/zhzhenqin/paoding-analysis) &#28304;&#30721;&#65307;

###### &#22522;&#20110;&#32479;&#35745;&#30340;&#20998;&#35789;&#24037;&#20855;
* &#20013;&#31185;&#38498;&#30340; [ICTCLAS](http://ictclas.nlpir.org/docs) &#20998;&#35789;&#65292;&#20197;&#21450;Java&#29256;&#30340;&#23454;&#29616; [ansj](https://github.com/NLPchina/ansj_seg)&#65292;ansj &#30340;&#24615;&#33021;&#24050;&#36229;&#36234; [ICTCLAS](http://ictclas.nlpir.org/docs) &#65307;ICTCLAS&#26159;&#22522;&#20110;HMM&#30340;&#20998;&#35789;&#24211;&#12290;


#### &#21442;&#32771;&#36164;&#26009;
[&#26377;&#21738;&#20123;&#27604;&#36739;&#22909;&#30340;&#20013;&#25991;&#20998;&#35789;&#26041;&#26696;&#65311;](https://www.zhihu.com/question/19578687)
[&#20013;&#25991;&#20998;&#35789;-&#30334;&#24230;&#30334;&#31185;](http://baike.baidu.com/view/19109.htm)
[&#24120;&#29992;&#30340;&#24320;&#28304;&#20013;&#25991;&#20998;&#35789;&#24037;&#20855; ](http://www.scholat.com/vpost.html?pid=4477)
[NLP&#20013;&#30340;&#20013;&#25991;&#20998;&#35789;&#25216;&#26415;](http://www.open-open.com/lib/view/open1420814197171.html)
	</xmp>

	<script src="http://strapdownjs.com/v/0.2/strapdown.js"></script>
</html>