<!DOCTYPE html>
<html>
	<title>ZooKeeper &#31616;&#20171;</title>
	<meta charset="UTF-8">

	<xmp theme="united" style="display:none;">
&#32763;&#35793;&#33258;&#23448;&#32593; [Overview](https://zookeeper.apache.org/doc/trunk/zookeeperOver.html)
___
##### ZooKeeper: &#20998;&#24067;&#24335;&#24212;&#29992;&#30340;&#20998;&#24067;&#24335;&#21327;&#35843;&#26381;&#21153;
ZooKeeper &#26159;&#19968;&#20010;&#29992;&#20110;&#20998;&#24067;&#24335;&#24212;&#29992;&#30340;&#20998;&#24067;&#24335;&#12289;&#24320;&#28304;&#30340;&#21327;&#35843;&#26381;&#21153;&#12290;&#23427;&#24320;&#25918;&#20102;&#19968;&#22871;&#31616;&#21333;&#30340;&#20989;&#25968;&#65292;&#20998;&#24067;&#24335;&#24212;&#29992;&#21487;&#20197;&#22312;&#27492;&#20043;&#19978;&#20026;&#19978;&#23618;&#26381;&#21153;&#23454;&#29616;&#20998;&#24067;&#24335;&#21516;&#27493;&#12289;&#37197;&#32622;&#32500;&#25252;&#12289;&#32452;&#26381;&#21153;&#12289;&#21629;&#21517;&#31561;&#21151;&#33021;&#12290;&#23427;&#20351;&#29992;&#20102;&#19968;&#20010;&#31867;&#20284;&#20110;&#30446;&#24405;&#26641;&#32467;&#26500;&#30340;&#25991;&#20214;&#31995;&#32479;&#20316;&#20026;&#25968;&#25454;&#27169;&#22411;&#65292;&#26131;&#20110;&#32534;&#31243;&#12290;&#23427;&#36816;&#34892;&#22312;java&#19978;&#65292;&#32780;&#19988;&#24050;&#32463;&#26377;&#20102;Java&#21644;C&#30340;&#23458;&#25143;&#31471;&#12290;

&#20247;&#25152;&#21608;&#30693;&#65292;&#21327;&#35843;&#26381;&#21153;&#26159;&#24456;&#38590;&#27491;&#30830;&#23454;&#29616;&#30340;&#12290;&#23427;&#20204;&#24456;&#23481;&#26131;&#20986;&#29616;&#26465;&#20214;&#31454;&#20105;&#21644;&#27515;&#38145;&#31561;&#38169;&#35823;&#12290;ZooKeeper &#20986;&#29616;&#30340;&#30446;&#30340;&#23601;&#26159;&#35299;&#38500;&#20026;&#20998;&#24067;&#24335;&#24212;&#29992;&#23454;&#29616;&#21327;&#35843;&#26381;&#21153;&#30340;&#30171;&#28857;&#12290;

##### &#35774;&#35745;&#30446;&#26631;
**ZooKeeper is simple.**  ZooKeeper &#20801;&#35768;&#20998;&#24067;&#24335;&#30340;&#36827;&#31243;&#36890;&#36807;&#20849;&#20139;&#21629;&#21517;&#31354;&#38388;&#23618;&#27425;&#26469;&#30456;&#20114;&#21327;&#35843;&#65292;&#20849;&#20139;&#21629;&#21517;&#31354;&#38388;&#23618;&#27425;&#26377;&#28857;&#31867;&#20284;&#20110;&#26631;&#20934;&#30340;&#25991;&#20214;&#31995;&#32479;&#12290;&#21629;&#21517;&#31354;&#38388;&#30001;&#25968;&#25454;&#23492;&#23384;&#22120;&#32452;&#25104;&#65292;ZooKeeper &#20013;&#30340;&#35828;&#27861;&#26159; znodes&#65292;&#31867;&#20284;&#20110;&#25991;&#20214;&#21644;&#30446;&#24405;&#12290;&#19982;&#20856;&#22411;&#30340;&#25991;&#20214;&#31995;&#32479;&#19981;&#21516;&#65292;&#20854;&#34987;&#35774;&#35745;&#29992;&#20110;&#23384;&#20648;&#65292;ZooKeeper &#25968;&#25454;&#23384;&#25918;&#22312;&#20869;&#23384;&#20013;&#12290;&#20063;&#23601;&#26159;&#35828;ZooKeeper &#21487;&#20197;&#23454;&#29616;&#39640;&#21534;&#21520;&#37327;&#21644;&#20302;&#24310;&#36831;&#25968;&#12290; 
ZooKeeper &#23436;&#32654;&#30340;&#23454;&#29616;&#20102;&#39640;&#24615;&#33021;&#12289;&#39640;&#21487;&#29992;&#12289;&#20005;&#26684;&#26377;&#24207;&#30340;&#35775;&#38382;&#12290;&#24615;&#33021;&#26041;&#38754;&#65292;ZooKeeper &#21487;&#20197;&#29992;&#22312;&#22823;&#35268;&#27169;&#12289;&#20998;&#24067;&#24335;&#30340;&#31995;&#32479;&#20013;&#12290;&#21487;&#38752;&#24615;&#26041;&#38754;&#65292;&#35299;&#20915;&#20102;&#21333;&#28857;&#38556;&#30861;&#12290;&#20005;&#26684;&#26377;&#24207;&#24847;&#21619;&#30528;&#21487;&#20197;&#20174;&#23458;&#25143;&#31471;&#23454;&#29616;&#22797;&#26434;&#30340;&#21516;&#27493;&#20989;&#25968;&#12290;
**ZooKeeper is replicated.** &#31867;&#20284;&#20110;&#20998;&#24067;&#24335;&#36827;&#31243;&#21327;&#35843;&#65292;ZooKeeper &#33258;&#36523;&#21487;&#34987;&#22797;&#21046;&#21103;&#26412;&#21040;&#19968;&#32452;&#20027;&#26426;&#19978;&#20316;&#20026;&#19968;&#20010;&#25972;&#20307;&#12290;

![ZooKeeper Service](https://zookeeper.apache.org/doc/trunk/images/zkservice.jpg)

ZooKeeper &#26381;&#21153;&#30340;&#26381;&#21153;&#31471;&#30456;&#20114;&#30693;&#36947;&#24444;&#27492;&#30340;&#23384;&#22312;&#12290;&#20182;&#20204;&#32500;&#25252;&#20102;&#19968;&#20010;&#20869;&#23384;&#38236;&#20687;&#30340;&#29366;&#24577;&#65292;&#36830;&#21516;&#20107;&#21153;&#26085;&#24535;&#21644;&#24555;&#29031;&#38598;&#19968;&#36215;&#25345;&#20037;&#21270;&#23384;&#20648;&#12290;&#21482;&#35201;&#22823;&#22810;&#25968;&#26381;&#21153;&#22120;&#21487;&#29992;&#65292;&#37027;&#20040;ZooKeeper &#26381;&#21153;&#23558;&#26159;&#21487;&#29992;&#30340;&#12290;

&#23458;&#25143;&#31471;&#36830;&#25509;&#19968;&#20010;&#21333;&#29420;&#30340; ZooKeeper &#26381;&#21153;&#31471;&#12290;&#23458;&#25143;&#31471;&#32500;&#25252;&#20102;&#19968;&#20010;TCP &#30340;&#36830;&#25509;&#65292;&#36890;&#36807;&#23427;&#26469;&#21457;&#36865;&#35831;&#27714;&#12289;&#33719;&#21462;&#21709;&#24212;&#12289;&#33719;&#21462;watch&#20107;&#20214;&#20197;&#21450;&#21457;&#36865;&#24515;&#36339;&#12290;&#22914;&#26524;&#19982;&#26381;&#21153;&#31471;&#30340;&#36830;&#25509;&#26029;&#20102;&#65292;&#23458;&#25143;&#31471;&#23558;&#20250;&#36830;&#21040;&#20854;&#20182;&#30340;&#26381;&#21153;&#31471;&#12290;

**ZooKeeper is ordered.** ZooKeeper &#20026;&#27599;&#20010;&#26356;&#26032;&#26631;&#35760;&#20102;&#24207;&#21495;&#65292;&#23427;&#21453;&#24212;&#20102;ZooKeeper &#20107;&#21153;&#30340;&#39034;&#24207;&#12290;&#24182;&#21457;&#25805;&#20316;&#21487;&#20197;&#29992;&#36825;&#20010;&#24207;&#21495;&#26469;&#23454;&#29616;&#26356;&#39640;&#23618;&#27425;&#30340;&#25277;&#35937;&#65292;&#20363;&#22914;&#21516;&#27493;&#26381;&#21153;&#12290;

**ZooKeeper is fast.** &#23427;&#22312;&#20197;&#35835;&#20026;&#20027;&#30340;&#22330;&#26223;&#19979;&#38750;&#24120;&#24555;&#12290;ZooKeeper &#24212;&#29992;&#36816;&#34892;&#22312;&#25968;&#21315;&#21488;&#26426;&#22120;&#19978;&#65292;&#22312;&#35835;&#20889;&#27604;&#20026; **10:1** &#30340;&#26102;&#20505;&#34920;&#29616;&#26368;&#20339;&#12290;

##### &#25968;&#25454;&#27169;&#22411;&#19982;&#20998;&#23618;&#21629;&#21517;&#31354;&#38388;
ZooKeeper &#25552;&#20379;&#30340;&#21629;&#21517;&#31354;&#38388;&#38750;&#24120;&#20687;&#26631;&#20934;&#30340;&#25991;&#20214;&#31995;&#32479;&#12290;&#21517;&#23383;&#26159;&#36335;&#24452;&#20803;&#32032;&#36890;&#36807;&#26012;&#26464;&#65288;/&#65289;&#20998;&#21106;&#30340;&#24207;&#21015;&#12290; ZooKeeper &#21629;&#21517;&#31354;&#38388;&#20013;&#30340;&#27599;&#20010;&#33410;&#28857;&#37117;&#26159;&#19968;&#20010;&#21807;&#19968;&#30340;&#36335;&#24452;&#12290;

![ZooKeeper &#30340;&#23618;&#32423;&#21629;&#21517;&#31354;&#38388;](http://upload-images.jianshu.io/upload_images/1247999-6b70d9f694a385d9.png?imageMogr2/auto-orient/strip%7CimageView2/2/w/1240)

##### &#33410;&#28857;&#20197;&#21450;&#20020;&#26102;&#33410;&#28857;
&#19982;&#26631;&#20934;&#30340;&#25991;&#20214;&#31995;&#32479;&#19981;&#21516;&#65292;ZooKeeper &#21629;&#21517;&#31354;&#38388;&#20013;&#30340;&#27599;&#20010;&#33410;&#28857;&#37117;&#23384;&#26377;&#19982;&#23376;&#33410;&#28857;&#30456;&#20851;&#30340;&#25968;&#25454;&#12290;&#23427;&#23601;&#20687;&#19968;&#20010;&#25991;&#20214;&#31995;&#32479;&#20801;&#35768;&#25991;&#20214;&#21464;&#25104;&#19968;&#20010;&#30446;&#24405;&#12290;(ZooKeeper &#20026;&#23384;&#20648;&#21327;&#35843;&#25968;&#25454;&#32780;&#35774;&#35745;&#65306;&#29366;&#24577;&#20449;&#24687;&#12289;&#37197;&#32622;&#20449;&#24687;&#12289;&#36335;&#24452;&#20449;&#24687;&#31561;&#65292;&#22240;&#27492;&#27599;&#20010;&#33410;&#28857;&#23384;&#20648;&#30340;&#25968;&#25454;&#36890;&#24120;&#37117;&#24456;&#23567;&#65292;&#37327;&#32423;&#22312;B&#21040;KB&#20043;&#38388;&#12290;&#65289;&#25105;&#20204;&#29992;&#26415;&#35821;*znode* &#26469;&#25351;ZooKeeper &#25968;&#25454;&#33410;&#28857;&#12290;

Znodes &#30340;&#25968;&#25454;&#32467;&#26500;&#20013;&#21253;&#25324;&#65306;&#25968;&#25454;&#21464;&#26356;&#30340;&#29256;&#26412;&#21495;&#12289;ACL &#21464;&#26356;&#20197;&#21450;&#26102;&#38388;&#25139;&#65292;&#20197;&#20415;&#32531;&#23384;&#39564;&#35777;&#21644;&#21327;&#35843;&#26356;&#26032;&#12290;&#27599;&#27425;znode&#25968;&#25454;&#25913;&#21464;&#65292;&#29256;&#26412;&#21495;&#36882;&#22686;&#12290;&#20363;&#22914;&#65292;&#27599;&#24403;&#23458;&#25143;&#31471;&#25910;&#21040;&#25968;&#25454;&#65292;&#23427;&#23558;&#21516;&#26102;&#25910;&#21040;&#25968;&#25454;&#30340;&#29256;&#26412;&#12290;

&#21629;&#21517;&#31354;&#38388;&#20013;znode&#23384;&#20648;&#30340;&#25968;&#25454;&#26159;&#34987;&#21407;&#23376;&#24615;&#35835;&#20889;&#30340;&#12290;&#35835;&#25805;&#20316;&#21487;&#20197;&#33719;&#24471;Znode&#30456;&#20851;&#30340;&#20840;&#37096;&#25968;&#25454;&#65292;&#20889;&#25805;&#20316;&#23558;&#35206;&#30422;&#20840;&#37096;&#25968;&#25454;&#12290;&#27599;&#20010;&#21450;&#35830;&#21333;&#26377;&#19968;&#20010;&#26435;&#38480;&#25511;&#21046;&#21015;&#34920;&#65288; Access Control List &#65292;ACL&#65289;&#26469;&#38480;&#21046;&#20160;&#20040;&#20154;&#21487;&#20197;&#24178;&#20160;&#20040;&#20107;&#12290;

ZooKeeper &#20063;&#26377;&#20020;&#26102;&#33410;&#28857;&#30340;&#27010;&#24565;. &#36825;&#20123;&#33410;&#28857;&#23384;&#22312;&#26102;&#38388;&#19982;&#20250;&#35805;&#19968;&#33268;&#65292;&#20250;&#35805;&#21019;&#24314;&#26102;znode&#29983;&#25928;&#12290;&#24403;&#20250;&#35805;&#32467;&#26463;&#26102;Znode&#34987;&#21024;&#38500;&#12290;&#20020;&#26102;&#33410;&#28857;&#23545;&#20320;&#23454;&#29616;&#21151;&#33021;&#38750;&#24120;&#26377;&#29992;&#65292;&#35831;&#21442;&#32771;*[tbd]*&#12290;
##### Conditional updates and watches
ZooKeeper &#25903;&#25345;*watches* &#30340;&#27010;&#24565;. &#23458;&#25143;&#31471;&#21487;&#20197;&#22312;Znodes&#19978;&#35774;&#19968;&#20010;watch &#12290;znode &#25913;&#21464;&#26102;&#20250;&#35302;&#21457;&#25110;&#21024;&#38500;watch&#12290;&#24403;watch &#34987;&#35302;&#21457;&#26102;&#65292;&#23458;&#25143;&#31471;&#20250;&#25910;&#21040;&#19968;&#20010;&#35828;znode&#24050;&#34987;&#25913;&#21464;&#30340;&#21253;&#12290;&#24182;&#19988;&#65292;&#22914;&#26524;&#23458;&#25143;&#31471;&#21644;&#19968;&#20010;Zookeeper&#26381;&#21153;&#22120;&#20043;&#38388;&#30340;&#36830;&#25509;&#20013;&#26029;&#26102;&#65292;&#23458;&#25143;&#31471;&#20250;&#25910;&#21040;&#19968;&#20010;&#26412;&#22320;&#36890;&#30693;&#12290;&#23545;&#20110;&#22914;&#20309;&#20351;&#29992;&#65292;&#35831;&#21442;&#32771;*[tbd]*&#12290;

##### &#20445;&#38556;
ZooKeeper &#38750;&#24120;&#31616;&#21333;&#12289;&#36805;&#36895;&#65292;&#36825;&#28304;&#33258;&#20110;&#23427;&#30340;&#35774;&#35745;&#30446;&#26631;&#12290;&#22240;&#27492;&#23427;&#20026;&#26500;&#24314;&#26356;&#22797;&#26434;&#30340;&#26381;&#21153;&#25552;&#20379;&#20102;&#22522;&#30784;&#12290;&#20363;&#22914;&#20026;&#21516;&#27493;&#26381;&#21153;&#25552;&#20379;&#20102;&#19968;&#22871;&#20445;&#38556;&#65306;
* Sequential Consistency&#65288;&#39034;&#24207;&#19968;&#33268;&#24615;&#65289; - &#25353;&#29031;&#23458;&#25143;&#31471;&#30340;&#21457;&#36865;&#39034;&#24207;&#36827;&#34892;&#26356;&#26032;&#12290;
* Atomicity&#65288;&#21407;&#23376;&#24615;&#65289;- &#26356;&#26032;&#25110;&#25104;&#21151;&#25110;&#22833;&#36133;&#12290;&#19981;&#20250;&#26377;&#20013;&#38388;&#24577;&#30340;&#37096;&#20998;&#32467;&#26524;&#12290;
* Single System Image&#65288;&#21333;&#19968;&#31995;&#32479;&#38236;&#20687;&#65289; - &#26080;&#35770;&#23458;&#25143;&#31471;&#25110;&#26381;&#21153;&#22120;&#65292;&#36830;&#25509;&#21040;&#26381;&#21153;&#31471;&#21518;&#37117;&#33021;&#30475;&#21040;&#21516;&#26679;&#30340;&#35270;&#22270;&#12290;
* Reliability&#65288;&#21487;&#38752;&#24615;&#65289; - &#19968;&#26086;&#24212;&#29992;&#19968;&#20010;&#26356;&#26032;&#65292;&#23427;&#23558;&#30041;&#23384;&#21040;&#23458;&#25143;&#31471;&#35206;&#30422;&#26412;&#27425;&#26356;&#26032;&#20026;&#27490;&#12290;
* Timeliness&#65288;&#26102;&#25928;&#24615;&#65289; - &#22312;&#19968;&#27573;&#26102;&#38388;&#20869;&#20445;&#35777;&#31995;&#32479;&#30340;&#23458;&#25143;&#31471;&#35270;&#22270;&#26159;&#26368;&#26032;&#30340;&#12290;

&#26356;&#22810;&#20449;&#24687;&#20197;&#21450;&#20182;&#20204;&#24590;&#20040;&#20351;&#29992;&#65292;&#35831;&#30475;*[tbd]*&#12290;
##### Simple API
ZooKeeper &#20854;&#20013;&#19968;&#20010;&#35774;&#35745;&#30446;&#26631;&#26159;&#25552;&#20379;&#19968;&#20010;&#38750;&#24120;&#31616;&#21333;&#30340;&#32534;&#31243;&#25509;&#21475;&#12290;&#26368;&#32456;&#65292;&#23427;&#21482;&#25903;&#25345;&#36825;&#20123;&#25805;&#20316;&#65306;
**_ create _** &#65306;&#22312;&#26641;&#30340;&#26576;&#20010;&#20301;&#32622;&#21019;&#24314;&#19968;&#20010;&#33410;&#28857;
**_ delete _** &#65306;&#21024;&#38500;&#19968;&#20010;&#33410;&#28857;
**_ exists _** &#65306;&#27979;&#35797;&#26576;&#20010;&#20301;&#32622;&#30340;&#33410;&#28857;&#26159;&#21542;&#23384;&#22312;
**_ get data _** &#65306;&#20174;&#33410;&#28857;&#20013;&#33719;&#21462;&#25968;&#25454;
**_ set data _** &#65306;&#23558;&#25968;&#25454;&#20889;&#20837;&#33410;&#28857;&#20013;
**_ get children _** &#65306;&#33719;&#21462;&#23376;&#33410;&#28857;&#30340;&#21015;&#34920;
**_ sync _** &#65306;&#31561;&#24453;&#25968;&#25454;&#21516;&#27493;

&#23545;&#20110;&#26356;&#28145;&#20837;&#30340;&#25506;&#35752;&#65292;&#20197;&#21450;&#20182;&#20204;&#24590;&#26679;&#29992;&#20110;&#39640;&#32423;&#30340;&#25805;&#20316;&#65292;&#35831;&#21442;&#38405;*[tbd]*&#12290;

##### &#23454;&#29616;
[ZooKeeper &#32452;&#20214;](https://zookeeper.apache.org/doc/trunk/zookeeperOver.html#fg_zkComponents) &#23637;&#31034;&#20102;ZooKeeper &#26381;&#21153;&#30340;&#39640;&#32423;&#32452;&#20214;&#12290;&#38500;&#35831;&#27714;&#22788;&#29702;&#22120;&#20197;&#22806;&#65292;&#26500;&#25104;ZooKeeper &#26381;&#21153;&#30340;&#27599;&#20010;&#26381;&#21153;&#31471;&#30340;&#21103;&#26412;&#38598;&#37117;&#25335;&#36125;&#33258;&#23427;&#30340;&#27599;&#20010;&#32452;&#20214;&#12290;

![ZooKeeper &#32452;&#20214;](http://upload-images.jianshu.io/upload_images/1247999-629d8fe2e33027c9.png?imageMogr2/auto-orient/strip%7CimageView2/2/w/1240)
&#21103;&#26412;&#25968;&#25454;&#24211;&#26159;&#19968;&#20010;&#20869;&#23384;&#25968;&#25454;&#24211;&#65292;&#21253;&#21547;&#20102;&#25972;&#20010;&#25968;&#25454;&#26641;&#12290;&#26356;&#26032;&#26085;&#24535;&#24207;&#21015;&#21270;&#21518;&#35760;&#24405;&#22312;&#30913;&#30424;&#19978;&#65292;&#29992;&#26469;&#24674;&#22797;&#25968;&#25454;&#12290;

&#27599;&#20010;Zookeeper&#26381;&#21153;&#22120;&#26381;&#21153;&#30340;&#23458;&#25143;&#31471;&#12290;&#23458;&#25143;&#31471;&#20934;&#30830;&#30340;&#36830;&#25509;&#21040;&#19968;&#20010;&#26381;&#21153;&#31471;&#21518;&#25552;&#20132;&#35831;&#27714;&#12290;&#35835;&#35831;&#27714;&#20174;&#27599;&#20010;&#26381;&#21153;&#22120;&#25968;&#25454;&#24211;&#30340;&#26412;&#22320;&#21103;&#26412;&#20013;&#21709;&#24212;&#12290;&#26381;&#21153;&#29366;&#24577;&#21464;&#26356;&#35831;&#27714;&#12289;&#20889;&#35831;&#27714;&#25353;&#29031;&#32422;&#23450;&#30340;&#21327;&#35758;&#25191;&#34892;&#12290;

&#21327;&#35758;&#30340;&#19968;&#37096;&#20998;&#65292;&#23458;&#25143;&#31471;&#30340;&#20840;&#37096;&#20889;&#35831;&#27714;&#34987;&#36716;&#21040;&#21483;&#39046;&#23548;&#32773;&#65288;*leader*&#65289;&#30340;&#19968;&#20010;&#29420;&#31435;&#30340;&#26381;&#21153;&#31471;&#12290;&#20854;&#20313;&#30340;Zookeeper&#26381;&#21153;&#31471;&#65292;&#31216;&#20026;&#20174;&#26381;&#21153;&#65288;*followers*&#65289; ,&#20174;&#39046;&#23548;&#32773;&#65288;*leader*&#65289;&#37027;&#36793;&#25509;&#25910;&#28040;&#24687;&#24182;&#30830;&#35748;&#28040;&#24687;&#24050;&#25910;&#21040;&#12290;&#28040;&#24687;&#23618;&#36127;&#36131;&#22312;&#39046;&#23548;&#32773;&#21457;&#29983;&#25925;&#38556;&#26102;&#26356;&#25442;&#39046;&#23548;&#32773;&#24182;&#21516;&#27493;&#25968;&#25454;&#21040;&#20174;&#26381;&#21153;&#12290;

ZooKeeper &#37319;&#29992;&#20102;&#19968;&#20010;&#33258;&#23450;&#20041;&#30340;&#21407;&#23376;&#28040;&#24687;&#21327;&#35758;&#12290;&#30001;&#20110;&#28040;&#24687;&#23618;&#26159;&#21407;&#23376;&#30340;&#65292;Zookeeper &#21487;&#20197;&#20445;&#35777;&#26412;&#22320;&#21103;&#26412;&#27809;&#26377;&#20559;&#24046;&#12290;&#24403;&#39046;&#23548;&#32773;&#25910;&#21040;&#19968;&#20010;&#20889;&#35831;&#27714;&#26102;&#65292;&#23427;&#20250;&#35745;&#31639;&#20986;&#31995;&#32479;&#20309;&#26102;&#20570;&#20102;&#20889;&#25805;&#20316;&#65292;&#24182;&#22312;&#20107;&#21153;&#20013;&#26356;&#26032;&#26368;&#26032;&#29366;&#24577;&#12290;

##### &#20351;&#29992;
ZooKeeper &#30340;&#31243;&#24207;&#25509;&#21475;&#21051;&#24847;&#31616;&#21333;&#21270;&#12290;With it, however, you can implement higher order operations, &#36890;&#36807;&#23427;&#65292;&#20320;&#21487;&#20197;&#23454;&#29616;&#39640;&#23618;&#27425;&#30340;&#25805;&#20316;&#65292;&#20363;&#22914;&#21516;&#27493;&#26381;&#21153;&#65292;&#32452;&#25104;&#21592;&#65292;&#26435;&#38480;&#31561;&#12290;&#19968;&#20123;&#20998;&#24067;&#24335;&#24212;&#29992;&#29992;&#23427;&#65306; *[tbd: &#30333;&#30382;&#20070;&#21644;&#35270;&#39057;&#28436;&#31034;&#20013;&#26032;&#22686;&#29992;&#36884;]* &#26356;&#22810;&#20449;&#24687;&#35831;&#30475;&#65306;*[tbd]*

###### &#24615;&#33021;
ZooKeeper &#20026;&#39640;&#24615;&#33021;&#32780;&#35774;&#35745;&#12290;&#20294;&#23427;&#21040;&#24213;&#24590;&#26679;&#21602;&#65311;ZooKeeper &#24320;&#21457;&#22242;&#38431;&#22312;Yahoo! &#30740;&#31350;&#34920;&#26126;&#23427;&#38750;&#24120;&#20248;&#31168;&#12290;&#65288;&#21442;&#35265;[ZooKeeper &#19981;&#21516;&#35835;&#20889;&#27604;&#20363;&#19979;&#30340;&#21534;&#21520;&#37327;](https://zookeeper.apache.org/doc/trunk/zookeeperOver.html#fg_zkPerfRW)&#65289;&#23427;&#22312;&#35835;&#22823;&#20110;&#20889;&#26102;&#65292;&#24615;&#33021;&#34920;&#29616;&#26356;&#20339;&#65292;&#22240;&#20026;&#20889;&#25805;&#20316;&#20250;&#28041;&#21450;&#25152;&#26377;&#26381;&#21153;&#31471;&#30340;&#29366;&#24577;&#21516;&#27493;&#12290;&#65288;&#35835;&#22823;&#20110;&#20889;&#26159;&#21327;&#35843;&#26381;&#21153;&#20013;&#20856;&#22411;&#30340;&#26696;&#20363;&#65289;


![ZooKeeper &#19981;&#21516;&#35835;&#20889;&#27604;&#20363;&#19979;&#30340;&#21534;&#21520;&#37327;](http://upload-images.jianshu.io/upload_images/1247999-d5e33ba3f3b17cfe.png?imageMogr2/auto-orient/strip%7CimageView2/2/w/1240)

&#22270; [ZooKeeper &#19981;&#21516;&#35835;&#20889;&#27604;&#20363;&#19979;&#30340;&#21534;&#21520;&#37327;](https://zookeeper.apache.org/doc/trunk/zookeeperOver.html#fg_zkPerfRW) &#26159;&#19968;&#20010;ZooKeeper 3.2&#29256;&#26412;&#36816;&#34892;&#22312;&#21452;&#26680; 2Ghz Xeon + 2 SATA 15K RPM&#30913;&#30424;&#30340;&#26381;&#21153;&#22120;&#19978;&#30340;&#21534;&#21520;&#37327;&#26354;&#32447;&#12290;&#19968;&#20010;&#30913;&#30424;&#19987;&#38376;&#29992;&#20110;&#23384;&#20648;Zookeeper&#26085;&#24535;&#12290;&#24555;&#29031;&#34987;&#20889;&#22312;&#31995;&#32479;&#30913;&#30424;&#19978;&#12290;&#20849;1000&#27425; &#35835;/&#20889;&#35831;&#12290; "Servers" &#25351;&#30340;&#26159;&#19968;&#20123;Zookeeper &#38598;&#32676;&#65292;&#36825;&#20123; "Servers" &#26500;&#25104;&#20102;Zookeeper&#26381;&#21153;&#12290;&#21478;&#22806;&#22823;&#32422;&#29992;30&#21488;&#26426;&#22120;&#26469;&#27169;&#25311;&#23458;&#25143;&#31471;&#12290;ZooKeeper &#38598;&#32676;&#30340;&#39046;&#23548;&#32773;&#65288;Leader&#65289;&#34987;&#37197;&#32622;&#20026;&#19981;&#25509;&#21463;&#23458;&#25143;&#31471;&#30340;&#36830;&#25509;&#12290;

**&#22312; 3.2 &#29256;&#20013; &#35835;/&#20889; &#24615;&#33021;&#27604; [3.1&#20043;&#21069;&#30340;](http://zookeeper.apache.org/docs/r3.1.1/zookeeperOver.html#Performance)&#29256;&#26412;&#25552;&#21319;2&#20493;&#20197;&#19978;&#12290;**

&#22522;&#20934;&#20063;&#34920;&#26126;&#23427;&#20063;&#26159;&#21487;&#38752;&#30340;&#12290;[&#20986;&#38169;&#26102;&#30340;&#21487;&#38752;&#24615;](https://zookeeper.apache.org/doc/trunk/zookeeperOver.html#fg_zkPerfReliability) &#26174;&#31034;&#20102;&#24590;&#26679;&#37096;&#32626;&#19968;&#20010;&#24212;&#23545;&#21508;&#31181;&#25925;&#38556;&#30340;&#21709;&#24212;&#26381;&#21153;&#12290;&#22270;&#20013;&#26631;&#35760;&#30340;&#20107;&#20214;&#22914;&#19979;&#65306;
1. &#20174;&#26381;&#21153;&#65288;follower&#65289;&#21457;&#29983;&#25925;&#38556;&#24182;&#24674;&#22797;
2. &#20854;&#20182;&#20174;&#26381;&#21153;&#65288;follower&#65289;&#21457;&#29983;&#25925;&#38556;&#24182;&#24674;&#22797;
3. &#39046;&#23548;&#32773;&#65288;leader&#65289;&#21457;&#29983;&#25925;&#38556;&#65307;
4. &#20004;&#20010;&#20174;&#26381;&#21153;&#65288;follower&#65289;&#21457;&#29983;&#25925;&#38556;&#24182;&#24674;&#22797;
5. &#20854;&#20182;&#39046;&#23548;&#32773;&#65288;leader&#65289;&#21457;&#29983;&#25925;&#38556;

##### &#21487;&#38752;&#24615;
&#25105;&#20204;&#36816;&#34892;&#19968;&#20010;&#30001;7&#21488;&#26426;&#22120;&#32452;&#25104;&#30340;Zookeeper&#26381;&#21153;&#65292;&#26469;&#23637;&#31034;&#31995;&#32479;&#25925;&#38556;&#26102;&#30340;&#34920;&#29616;&#12290;&#25105;&#20204;&#36816;&#34892;&#20102;&#19982;&#20043;&#21069;&#30456;&#21516;&#39281;&#21644;&#24230;&#30340;&#26381;&#21153;&#65292;&#20294;&#36825;&#27425;&#25105;&#20204;&#23558;&#20889;&#25805;&#20316;&#27604;&#20363;&#20445;&#25345;&#22312;30%&#65292;30%&#26159;&#25105;&#20204;&#39044;&#26399;&#24037;&#20316;&#36127;&#36733;&#30340;&#20445;&#23432;&#27604;&#20363;&#12290;

![&#20986;&#38169;&#26102;&#30340;&#21487;&#38752;&#24615;](http://upload-images.jianshu.io/upload_images/1247999-0d2a02709be0cf69.png?imageMogr2/auto-orient/strip%7CimageView2/2/w/1240)

&#36825;&#24133;&#22270;&#21487;&#20197;&#35266;&#23519;&#20986;&#19968;&#20123;&#38382;&#39064;&#12290;&#39318;&#20808;&#65292;&#22914;&#26524;&#20174;&#26381;&#21153;&#65288;followers&#65289;&#22833;&#36133;&#24182;&#24555;&#36895;&#24674;&#22797;&#65292;&#32463;&#31649;&#26377;&#22833;&#36133;&#20294;Zookeeper &#20219;&#28982;&#21487;&#20197;&#25552;&#20379;&#39640;&#21534;&#21520;&#37327;&#30340;&#26381;&#21153;&#12290;&#20294;&#26356;&#37325;&#35201;&#30340;&#26159;&#65292;&#39046;&#23548;&#32773;&#36873;&#20030;&#31639;&#27861;&#65288;leader election algorithm&#65289;&#21487;&#20197;&#20351;&#31995;&#32479;&#24555;&#36895;&#24674;&#22797;&#65292;&#36275;&#20197;&#38450;&#27490;&#21534;&#21520;&#37327;&#22823;&#24133;&#19979;&#38477;&#12290;&#25105;&#20204;&#30340;&#35266;&#23519;&#20013;&#65292;ZooKeeper &#20197;&#20302;&#20110;200ms &#30340;&#36895;&#24230;&#36873;&#20986;&#20102;&#39046;&#23548;&#32773;&#65288;leader&#65289;&#12290;&#31532;&#19977;&#65292;&#20174;&#26381;&#21153;&#65288;followers &#65289;&#24674;&#22797;&#21518;&#65292;ZooKeeper &#30001;&#20110;&#20174;&#26381;&#21153;&#65288;followers&#65289;&#24674;&#22797;&#65292;&#23427;&#20204;&#24320;&#22987;&#22788;&#29702;&#35831;&#27714;&#65292;&#21448;&#33021;&#25552;&#39640;&#21534;&#21520;&#37327;&#12290;

##### ZooKeeper &#39033;&#30446;
ZooKeeper &#24050;&#34987; [&#25104;&#21151;&#30340;&#29992;&#20110; ](https://cwiki.apache.org/confluence/display/ZOOKEEPER/PoweredBy)&#35768;&#22810;&#34892;&#19994;&#24212;&#29992;&#20013;&#12290; &#22312; Yahoo! &#20316;&#20026; Yahoo! Message Broker &#30340;&#21327;&#35843;&#21644;&#25925;&#38556;&#24674;&#22797;&#26381;&#21153;&#12290;Yahoo! Message Broker&#26159;&#19968;&#20010;&#39640;&#21487;&#25193;&#23637;&#24615;&#30340;&#35746;&#38405;&#21457;&#24067;&#31995;&#32479;&#12290;ZooKeeper &#31649;&#29702;&#30528;&#25104;&#21315;&#19978;&#19975;&#20010;Topics &#30340;&#21103;&#26412;&#21644;&#25968;&#25454;&#20132;&#20184;&#12290;&#23427;&#20026;Yahoo! &#29228;&#34411;&#25552;&#20379;Fetching &#26381;&#21153;&#21644;&#25925;&#38556;&#24674;&#22797;&#12290;&#19968;&#20123; Yahoo! &#30340;&#24191;&#21578;&#31995;&#32479;&#20063;&#22312;&#29992; ZooKeeper &#26469;&#23454;&#29616;&#30340;&#26381;&#21153;&#21487;&#38752;&#24615;&#12290;
&#40723;&#21169;&#25152;&#26377;&#29992;&#25143;&#21644;&#24320;&#21457;&#32773;&#21152;&#20837;&#31038;&#21306;&#24182;&#36129;&#29486;&#19987;&#19994;&#30693;&#35782;&#12290;&#26356;&#22810;&#20449;&#24687;&#35831;&#30475; [ Apache &#22522;&#37329;&#20250; Zookeeper&#39033;&#30446;](http://zookeeper.apache.org/)&#12290;
	</xmp>

	<script src="http://strapdownjs.com/v/0.2/strapdown.js"></script>
</html>